# Semana 7 [Exercícios] - SQL

In [1]:
import sqlite3

In [2]:
conexao=sqlite3.connect('exercicio_sql')
cursor=conexao.cursor()

1. Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [6]:
cursor.execute('CREATE TABLE alunos(id INT , nome VARCHAR(100) , idade INT , curso VARCHAR(100))')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.

In [9]:
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (1, "Cristiane da Paz" , 27 , "Arquitetura")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (2, "Débora Campos" , 26 , "Engenharia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (3, "Jorge Nicolas" , 20 , "Fisioterapia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (4, "Guilherme Aragão", 17 , "Engenharia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (5, "Camila Assis" , 23 , "Física")')

3. Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos".

In [15]:
dados= cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Cristiane da Paz', 27, 'Arquitetura')
(2, 'Débora Campos', 26, 'Engenharia')
(3, 'Jorge Nicolas', 20, 'Fisioterapia')
(4, 'Guilherme Aragão', 17, 'Engenharia')
(5, 'Camila Assis', 23, 'Física')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos

In [17]:
dados=cursor.execute('SELECT nome, idade FROM alunos WHERE idade>20')

for alunos in dados:
    print(alunos)

('Cristiane da Paz', 27)
('Débora Campos', 26)
('Camila Assis', 23)

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética

In [23]:
dados=cursor.execute('SELECT * FROM alunos WHERE curso = "Engenharia" ORDER BY nome')

for alunos in dados:
    print(alunos)

(2, 'Débora Campos', 26, 'Engenharia')
(4, 'Guilherme Aragão', 17, 'Engenharia')

d) Contar o número total de alunos na tabela

In [33]:
dados= cursor.execute('SELECT * FROM alunos')
contagem=[]
for alunos in dados:
    contagem.append(alunos)

print(f"O número total de alunos na tabela é {len(contagem)}")

O número total de alunos na tabela é 5

4. Atualização e Remoção

a) Atualize a idade de um aluno específico na tabela.

In [34]:
cursor.execute('UPDATE alunos SET idade=20 WHERE nome="Camila Assis"')

b) Remova um aluno pelo seu ID.

In [36]:
cursor.execute('DELETE FROM alunos WHERE id=5')

5. Criar uma Tabela e Inserir Dados

Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.

In [44]:
cursor.execute('CREATE TABLE clientes(id INT PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT)')

# Como colocar autoincremento?

In [51]:
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(1, "Cristiane da Paz" , 27 , 1200)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(2, "Joana da Paz" , 48 , 9038)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(3, "Geraldo Carlos" , 32 , 6200)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(4, "Guilherme Aragão" , 17 , 600)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(5, "Elza Yasmin" , 20 , 800)')

# Ao colocar 9600 ele entende no SQL que é 9.600, os 9 mil e pouco
# Se na inserção eu colocar 9.600 ele entende como 9,6 um número baixo

In [49]:
#cursor.execute('DELETE FROM clientes')

6. Consultas e Funções Agregadas

Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a
30 anos.

In [54]:
dados= cursor.execute('SELECT nome, idade FROM clientes WHERE idade>30')
for maisque30 in dados:
    print(maisque30)

('Joana da Paz', 48)
('Geraldo Carlos', 32)

b) Calcule o saldo médio dos clientes.

In [58]:
dados=cursor.execute('SELECT AVG(saldo) as "Média" FROM clientes ')

for media_saldo in dados:
    print(f"O saldo médio dos clientes é {media_saldo[0]}")

O saldo médio dos clientes é 3567.6

c) Encontre o cliente com o saldo máximo

In [62]:
dados=cursor.execute('SELECT id, nome, MAX(saldo) FROM clientes')

for maximo in dados:
    print(maximo)

(2, 'Joana da Paz', 9038.0)

d) Conte quantos clientes têm saldo acima de 1000.

In [66]:
dados=cursor.execute('SELECT COUNT(nome) FROM clientes WHERE saldo>1000')

for saldo_grande in dados:
    print(f"Existe {saldo_grande[0]} clientes com saldo acima de 1000")

# Queria ver quem eram

dados=cursor.execute('SELECT * FROM clientes WHERE saldo>1000')

for saldo_grande in dados:
    print(saldo_grande)

Existe 3 clientes com saldo acima de 1000
(1, 'Cristiane da Paz', 27, 1200.0)
(2, 'Joana da Paz', 48, 9038.0)
(3, 'Geraldo Carlos', 32, 6200.0)

7. Atualização e Remoção com Condições

a) Atualize o saldo de um cliente específico.

In [70]:
cursor.execute('UPDATE clientes SET saldo=9000 WHERE nome="Joana da Paz"')

b) Remova um cliente pelo seu ID.

In [72]:
cursor.execute('DELETE FROM clientes WHERE id=5')
# Elza era o id 5, foi removida

8. Junção de Tabelas

Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [78]:
cursor.execute('''
    CREATE TABLE compras (
        id INT PRIMARY KEY,
        cliente_id INT,
        produto VARCHAR(100),
        valor REAL,
        FOREIGN KEY (cliente_id) REFERENCES clientes(id)
    )
''')

Insira algumas compras associadas a clientes existentes na tabela "clientes".

In [86]:
cursor.execute('INSERT INTO compras(id,cliente_id ,produto ,valor) VALUES (1,1, "Ventilador", 90)')
cursor.execute('INSERT INTO compras(id,cliente_id ,produto ,valor) VALUES (2,3, "Alexa", 880)')
cursor.execute('INSERT INTO compras(id,cliente_id ,produto ,valor) VALUES (3,3, "Videogame X-box", 3000)')
cursor.execute('INSERT INTO compras(id,cliente_id ,produto ,valor) VALUES (4,4, "Box de Livros", 120)')
cursor.execute('INSERT INTO compras(id,cliente_id ,produto ,valor) VALUES (5,2, "Geladeira eletrolux", 4000)')

Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [94]:
# Aqui tem que se usar subqueries já que o nome do cliente está na outra tabela

dados=cursor.execute('''
               SELECT clientes.nome, compras.produto, compras.valor 
               FROM compras 
               JOIN clientes ON compras.cliente_id =clientes.id
''')

for consulta in dados:
    print(consulta)

('Cristiane da Paz', 'Ventilador', 90.0)
('Geraldo Carlos', 'Alexa', 880.0)
('Geraldo Carlos', 'Videogame X-box', 3000.0)
('Guilherme Aragão', 'Box de Livros', 120.0)
('Joana da Paz', 'Geladeira eletrolux', 4000.0)

Mostrando aqueles que tem salário superior à mil e suas compras

In [101]:
dados=cursor.execute('''
                SELECT clientes.nome, compras.produto, compras.valor, clientes.saldo FROM compras
                     JOIN clientes ON clientes.id=compras.cliente_id
                     WHERE clientes.saldo>1000
               
               ''')

for salario_compras in dados:
    print(salario_compras)

('Cristiane da Paz', 'Ventilador', 90.0, 1200.0)
('Geraldo Carlos', 'Alexa', 880.0, 6200.0)
('Geraldo Carlos', 'Videogame X-box', 3000.0, 6200.0)
('Joana da Paz', 'Geladeira eletrolux', 4000.0, 9000.0)

In [87]:
conexao.commit()
conexao.close